greeting_message = 'Я бот, гарантирующий конфиденциальность ваших сообщений.\n' \
                   'Только вы и ваш собеседник имеете к ним доступ.\n' \
                   'Весь процесс шифрования контролируется только вами,\n' \
                   'никакие сторонние сервисы не участвуют в процессе.\n' \
                   'Нажмите "📄 Описание", чтобы узнать больше.'

description = 'Привет! Я умный чат-бот, который поможет вам безопасно обмениваться,\n' \
              'сообщениями. Я зашифрую ваше сообщение, чтобы только вы и ваш собеседник.\n' \
              'могли его прочитать. Вот как это работает:\n' \
              '\n' \
              '1️⃣ Нажмите "🔐 Зашифровать сообщение", введите текст, затем # и ключ, далее отправьте.\n' \
              '(Пример: введено - Привет мир#3 -> результат - Тулеих плу).\n' \
              '2️⃣ Нажмите "🔓 Расшифровать сообщение", введите зашифрованный текст затем # и ключ, далее отправьте.\n' \
              '(Пример: введено - Тулеих плу#3 -> результат - Привет мир).\n' \
              '3️⃣ Я работаю на русском и английском языках.\n' \
              '4️⃣ Вы получаете 10 бесплатных сообщений, что бы протестировать мой функционал.\n' \
              '5️⃣ Оформить месячную подписку можно по кнопке "💰 Подписка", в подписку входит:\n' \
                '\t\t❇️ неограниченное количество сообщений в течении месяца;\n' \
                '\t\t❇️ доступ к группе 💬 Общий чат, где вы можете напрямую \n' \
                '\t\t\t\t\t\t\t\t\t\tпообщаться с разработчиками, задать им вопросы, \n' \
                '\t\t\t\t\t\t\t\t\t\tпредложить свои варианты для улучшения/модернизации \n' \
                '\t\t\t\t\t\t\t\t\t\tфункционала бота. Участвовать в опросах, конкурсах,\n' \
                '\t\t\t\t\t\t\t\t\t\tполучать свежие новости по обновлениям и т.п.;\n' \
                '\t\t❇️ доступ к закрытому каналу "💻 Кодовая семантика" \n' \
                '\t\t\t\t\t\t\t\t\t\tс самой свежей информации в мире IT.\n' \
              '6️⃣ Кнопка "🪪 Профиль" покажет сколько дней подписки у вас осталось.\n' \
              '\n' \
              'Мы надеемся, вы оцените нашего бота! Наша цель - ваша безопасность и удобство. Начнем?\n' \
              'Наша цель - обеспечить вам безопасность и удобство при обмене сообщениями.\n' \
              'Не забывайте хранить ключи для дешифрования в секрете!\n' \

shifr_text = 'Напишите ваш текст для зашифровки в формате: Сообщение#4:'
deshifr_text = 'Напишите ваш текст для расшифровки в формате: "Сообщение"#4:'
# feedback = ''
# delete = ''
